app/views/teams/_preference_selector.html.erb

SELECT  "preferences".* FROM "preferences" WHERE "preferences"."team_id" = ? AND "preferences"."project_id" = ? LIMIT 1  [["team_id", 5], ["project_id", 50]]
---
  <% check3 = false %>
  <% p = Preference.find_by(team_id: team.id, project_id: project.id) %>