app/views/teams/show.html.erb

<% if current_user.is_member?(@team) && !@team.is_leader?(current_user) %>
  <% r = Relationship.find_by(user_id: current_user.id, team_id: @team.id) %>
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."team_id" = ? LIMIT 1  [["user_id", 102], ["team_id", 3]]