app/controllers/assignments_controller.rb

  def download
    @assignments = []
    assign = Assignment.all
    i=1
    data = "SNo, Team, Project Title, Organization, Contact, Description, On Campus, Legacy SW\n"
    assign.each do |a|
      @project = Project.find_by(id: a.project_id)
      @team = Team.find_by(id: a.team_id)
      if @project.islegacy.to_s == "true"
        legacy="Yes"
      else
        legacy="No"
      end
      if @project.oncampus.to_s == "true"
        oncampus="Yes"
      else
        oncampus="No"
      end
      data << i.to_s << "," << @team.name.to_s.inspect << "," << @project.title << "," << @project.organization.to_s.inspect << "," << @project.contact.to_s.inspect << ","<< @project.description.to_s.inspect << "," << oncampus.to_s << "," << legacy.to_s << "\n"
---
SELECT "assignments".* FROM "assignments"
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ?  ORDER BY "projects"."created_at" DESC LIMIT 1  [["id", 50]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "projects" ("title", "organization", "contact", "description", "oncampus", "islegacy", "approved", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "teams" ("name", "user_id", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Swift LLC"], ["user_id", 1], ["code", "abcd"], ["created_at", "2015-05-06 00:47:53.485903"], ["updated_at", "2015-05-06 00:47:53.485903"]]

  def assign
    @teams = Team.all
    @projects = Project.where("approved = ?", true)
    @preassign = Preassignment.all
    @preassign.each do |p|
      @preproj = Project.find_by(id: p.project_id)
      @projects << @preproj
      pref = Preference.find_by(team_id: p.team_id, project_id: p.project_id)
      if !pref
        @pref = Preference.new do |prf|
          prf.team_id = p.team_id
          prf.project_id = p.project_id
          prf.value = 1
        end
        @pref.save
      end
    end
    @graph = Array.new(@teams.size){Array.new(@projects.size)}
---
SELECT "teams".* FROM "teams"
SELECT "projects".* FROM "projects" WHERE (approved = 't')  ORDER BY "projects"."created_at" DESC
SELECT "assignments".* FROM "assignments"
SELECT  "preferences".* FROM "preferences" WHERE "preferences"."team_id" = ? AND "preferences"."project_id" = ? LIMIT 1  [["team_id", 4], ["project_id", 50]]
SELECT COUNT(*) FROM "projects" WHERE (approved = 't')
SELECT COUNT(*) FROM "teams"



    #Clearing Old assignments
    Assignment.delete_all
---
DELETE FROM "assignments"

        team_index = @matching[i]
        team_no = @teams[team_index].id
        project_no = @projects[project_index].id
       Assignment.create(team_id: team_no, project_id: project_no)
---
INSERT INTO "assignments" ("team_id", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["team_id", 4], ["project_id", 50], ["created_at", "2015-05-05 04:28:28.694707"], ["updated_at", "2015-05-05 04:28:28.694707"]]

  def view
		@team_names = Array.new
		@project_names = Array.new
		Team.find_each do |team|
			@team_names << team.name
		end
		Project.find_each do |project|
			@project_names << project.title
		end

    @assignments = []
    assign = Assignment.all
    assign.each do |a|
      @project = Project.find_by(id: a.project_id)
      @team = Team.find_by(id: a.team_id)
---
SELECT "assignments".* FROM "assignments"
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ?  ORDER BY "projects"."created_at" DESC LIMIT 1  [["id", 50]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 5]]