app/controllers/preferences_controller.rb

SELECT  "teams".* FROM "teams" WHERE "teams"."user_id" = ? LIMIT 1  [["user_id", 3]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ?  ORDER BY "projects"."created_at" DESC LIMIT 1  [["id", 50]]
SELECT  "preferences".* FROM "preferences" WHERE "preferences"."team_id" = ? AND "preferences"."project_id" = ? LIMIT 1  [["team_id", 5], ["project_id", 50]]
UPDATE "preferences" SET "value" = ?, "updated_at" = ? WHERE "preferences"."id" = ?  [["value", -1], ["updated_at", "2015-05-05 07:47:48.565961"], ["id", 22]]
INSERT INTO "preferences" ("team_id", "project_id", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["team_id", 5], ["project_id", 50], ["value", 1], ["created_at", "2015-05-05 07:47:17.357325"], ["updated_at", "2015-05-05 07:47:17.357325"]]
---
  def create
    @team = Team.find_by(user_id: current_user.id)
    @project = Project.find_by(id: params[:project_id])
    @pref = Preference.find_by(team_id: @team.id, project_id: @project.id)
    if @pref
      @pref.value = params[:preference][:value]
      @pref.save
    else
      Preference.create(team_id: @team.id, project_id: @project.id, value: params[:preference][:value])