app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects"  ORDER BY "projects"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "projects"
---
        def index
                @title = "All Projects"
                @projects = Project.paginate(page: params[:page])

SELECT  "projects".* FROM "projects" WHERE (approved = 't')  ORDER BY "projects"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "projects" WHERE (approved = 't')
---
        def approved
                @title = "Approved Projects"
                @projects = Project.where("approved = ?", true).paginate(page: params[:page])

SELECT  "projects".* FROM "projects" WHERE (approved = 'f')  ORDER BY "projects"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "projects" WHERE (approved = 'f')
---
        def unapproved
                @title = "Unapproved Projects"
                @projects = Project.where("approved = ?", false).paginate(page: params[:page])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ?  ORDER BY "projects"."created_at" DESC LIMIT 1  [["id", 50]]
---
        def show
                @project = Project.find(params[:id])

INSERT INTO "projects" ("title", "organization", "contact", "description", "oncampus", "islegacy", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
        def create
                @project = Project.new(project_params)
                if @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ?  ORDER BY "projects"."created_at" DESC LIMIT 1  [["id", 49]]
UPDATE "projects" SET "title" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "Some Random Project"], ["updated_at", "2015-04-17 05:04:44.898121"], ["id", 1]]
---
        def update
                @project = Project.find(params[:id])
                if @project.update_attributes(project_params)

DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ?  ORDER BY "projects"."created_at" DESC LIMIT 1  [["id", 46]]
---
        def destroy
                Project.find(params[:id]).destroy

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "projects" SET "approved" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["approved", "t"], ["updated_at", "2015-04-19 00:25:02.854030"], ["id", 3]]
---
        def approve
                project = Project.find_by(id: params[:id])
                if project
                        if project.approved?
                                flash[:info] = "Project already approved"
                                redirect_to projects_url
                        else
                                project.approved = true
                                project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "projects" SET "approved" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["approved", "f"], ["updated_at", "2015-04-19 00:57:53.405188"], ["id", 3]]
---
        def unapprove
                project = Project.find_by(id: params[:id])
                if project
                        if !project.approved?
                                flash[:info] = "Project already unapproved"
                                redirect_to projects_url
                        else
                                project.approved = false
                                project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ?  ORDER BY "projects"."created_at" DESC LIMIT 1  [["id", 34]]
UPDATE "projects" SET "approved" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["approved", "f"], ["updated_at", "2015-04-19 05:20:46.638406"], ["id", 34]]
---
        def toggle
                @project = Project.find(params[:id])
                @project.toggle(:approved)