app/controllers/relationships_controller.rb

  def create
  	@team = Team.find_by(name: params[:relationship][:name])
  	if @team
  	  if @team.code == params[:relationship][:code]
        if Relationship.find_by(user_id: current_user.id, team_id: @team.id)
          flash[:warning] = "You are already a member"
          redirect_to @team
        else
  	      current_user.relationships.create(team_id: @team.id)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."name" = ? LIMIT 1  [["name", "asdf"]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."user_id" = ? LIMIT 1  [["user_id", 16], ["user_id", 16]]
INSERT INTO "relationships" ("team_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["team_id", 8], ["user_id", 1], ["created_at", "2015-04-19 11:24:26.137425"], ["updated_at", "2015-04-19 11:24:26.137425"]]

  def destroy
    @r = Relationship.find_by(id: params[:id])
    @team = Team.find_by(id: @r.team_id)
    if !@team
      flash[:danger] = "Critical Error"
      redirect_to root_url
    elsif @team.is_leader?(current_user)
      flash[:danger] = "Team leader cannot leave team"
      redirect_to @team
    else
      @r.destroy
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 7]]