app/controllers/teams_controller.rb

  def preference
    @team = current_user.is_member_of
    if @team
      @title = "Preference Selector"
      @projects = Project.where("approved = ?", true)
---
SELECT "projects".* FROM "projects" WHERE (approved = 't')  ORDER BY "projects"."created_at" DESC

  def index
    if current_user.admin?
      @teams = Team.paginate(page: params[:page])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."team_id" = 3 LIMIT 1
SELECT COUNT(*) FROM "teams"

  def show
  	@team = Team.find(params[:id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 8]]

  def create
    if current_user.teams.count != 0
      flash[:danger] = "You have already created one team"
      redirect_to root_url
    else
  	  @team = Team.new(team_params)
  	  @team.user_id = current_user.id
  	  @team.code = ('a'..'z').to_a.shuffle.take(4).join()
      if @team.save
---
SELECT COUNT(*) FROM "teams" WHERE "teams"."user_id" = ?  [["user_id", 1]]
INSERT INTO "teams" ("name", "user_id", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Jarvice"], ["user_id", 1], ["code", "wtbi"], ["created_at", "2015-04-19 11:00:29.924240"], ["updated_at", "2015-04-19 11:00:29.924240"]]

  def edit
  	@team = Team.find(params[:id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 4]]

  def destroy
    Team.find(params[:id]).destroy
---
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 3]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 3]]